Autodesk.Revit.DB.FaceAPIUtils.GetFaceEdgesAsCurveLoops(Autodesk.Revit.DB.Face)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.FaceAPIUtils.FaceXFaceIntersectWithResult(Autodesk.Revit.DB.Face,Autodesk.Revit.DB.Face,Autodesk.Revit.DB.Curve@)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.FaceAPIUtils.FaceXFaceIntersect(Autodesk.Revit.DB.Face,Autodesk.Revit.DB.Face)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.FaceAPIUtils.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FaceAPIUtils
Contains native implementations of face related functions exposed to API.
Remarks:
All of the static methods contained within logically belong within the API in Face or one of its subclasses.
The internal API wrappers are called directly by the related public API methods.